# Environment Setting

In [2]:
import pandas as pd

# Data Import & Preview

In [62]:
order = pd.read_csv('order_list.csv')
station = pd.read_csv('station_list.csv')
user = pd.read_csv('user_list.csv')

C:\Users\happy\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\IPython\core\interactiveshell.py:3251: DtypeWarning: Columns (14) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [50]:
order.head()

,이용자ID,호출일시,호출장소,탑승일시,탑승정류장,하차일시,하차정류장,어른(명),청소년(명),어린이(명),이동거리(m),요금(원),배차상태,배차상태상세,배차성공일시,취소일시
0,11506,0054-05-16 16:38:12.000000,"(37.49335710216712,126.49071292910158)",NaN,10109,NaN,12007,1,0,0,870,1800,탑승취소,개인사정,2021-07-30 16:38:19.000000,2021-07-30 16:38:39.000000
1,1,2021-02-15 00:00:24.000000,"(37.508301689901344,126.51395666732049)",NaN,10258,NaN,10093,1,0,0,0,0,배차불가,NaN,NaN,2021-02-15 00:00:25.000000
2,7,2021-02-15 00:00:35.000000,"(37.5085858,126.5137479)",NaN,10258,NaN,12005,1,0,0,0,0,배차불가,NaN,NaN,2021-02-15 00:00:35.000000
3,1,2021-02-15 00:00:46.000000,"(37.508370908943476,126.51402737025778)",NaN,10258,NaN,10093,1,0,0,0,0,배차불가,NaN,NaN,2021-02-15 00:00:46.000000
4,7901,2021-02-15 00:00:47.000000,"(37.5086122,126.5137468)",NaN,10258,NaN,10196,1,0,0,0,0,배차불가,NaN,NaN,2021-02-15 00:00:47.000000

In [14]:
# 319 stations
print(station.shape[0])
station.head()

319

,id,name,input_date,is_using,xy,st_no(공공정류소ID)
0,10011,힐스테이트,2021-01-04 14:50:54.000000,True,"(126.5642385,37.489032)",35458.0
1,10001,허브주유소,2021-01-04 14:50:54.000000,True,"(126.5298091,37.5049674)",35446.0
2,10921,햇내로공원입구,2021-01-04 14:50:54.000000,True,"(126.50107,37.49577)",35784.0
3,10920,햇내로공원입구,2021-01-04 14:50:54.000000,True,"(126.50135,37.4967)",35777.0
4,10027,해맞이공원앞,2021-01-04 14:50:54.000000,True,"(126.5318204,37.47709801)",35616.0

In [15]:
# 11,577 distinct users
print(user.shape[0])
user.head()

11577

   no               register_date
0   1  2021-02-15 00:00:24.000000
1   2  2021-02-15 00:04:24.000000
2   3  2021-02-02 17:24:00.000000
3   4  2021-02-17 15:36:51.000000
4   5  2021-02-04 10:58:00.000000

# Data Cleaning

### Datatype Conversion

In [63]:
order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3660646 entries, 0 to 3660645
Data columns (total 16 columns):
 #   Column   Dtype
---  ------   -----
 0   이용자ID    int64
 1   호출일시     object
 2   호출장소     object
 3   탑승일시     object
 4   탑승정류장    int64
 5   하차일시     object
 6   하차정류장    int64
 7   어른(명)    int64
 8   청소년(명)   int64
 9   어린이(명)   int64
 10  이동거리(m)  int64
 11  요금(원)    int64
 12  배차상태     object
 13  배차상태상세   object
 14  배차성공일시   object
 15  취소일시     object
dtypes: int64(8), object(8)
memory usage: 446.9+ MB

In [64]:
# '호출일시' datetime 이상치 제거
order = order.iloc[1:-2]

In [82]:
# Convert Datatype for columns : 호출일시, 탑승일시, 하차일시, 배차성공일시, 취소일시 

def convert(x):
    x = x.str.split('.').str[0].astype('datetime64')
    return x

order['call_time'] = convert(order['호출일시'])
order['alight_time'] = convert(order['탑승일시'])
order['off_time'] = convert(order['하차일시'])
order['suc_time'] = convert(order['배차성공일시'])
order['cancel_time'] = convert(order['취소일시'])

In [83]:
order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3660643 entries, 1 to 3660643
Data columns (total 21 columns):
 #   Column       Dtype
---  ------       -----
 0   이용자ID        int64
 1   호출일시         object
 2   호출장소         object
 3   탑승일시         object
 4   탑승정류장        int64
 5   하차일시         object
 6   하차정류장        int64
 7   어른(명)        int64
 8   청소년(명)       int64
 9   어린이(명)       int64
 10  이동거리(m)      int64
 11  요금(원)        int64
 12  배차상태         object
 13  배차상태상세       object
 14  배차성공일시       object
 15  취소일시         object
 16  call_time    datetime64[ns]
 17  alight_time  datetime64[ns]
 18  off_time     datetime64[ns]
 19  suc_time     datetime64[ns]
 20  cancel_time  datetime64[ns]
dtypes: datetime64[ns](5), int64(8), object(8)
memory usage: 586.5+ MB

In [84]:
order = order.drop(['호출일시', '탑승일시', '하차일시', '배차성공일시', '취소일시'], axis = 1)

In [95]:
# Split latitude and longitude for column '호출장소'

order[["x", "y"]] = order["호출장소"].str.strip(r"()").str.split(",", expand = True).astype(float)

In [97]:
order = order.drop(['호출장소'], axis = 1)

In [98]:
order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3660643 entries, 1 to 3660643
Data columns (total 17 columns):
 #   Column       Dtype
---  ------       -----
 0   이용자ID        int64
 1   탑승정류장        int64
 2   하차정류장        int64
 3   어른(명)        int64
 4   청소년(명)       int64
 5   어린이(명)       int64
 6   이동거리(m)      int64
 7   요금(원)        int64
 8   배차상태         object
 9   배차상태상세       object
 10  call_time    datetime64[ns]
 11  alight_time  datetime64[ns]
 12  off_time     datetime64[ns]
 13  suc_time     datetime64[ns]
 14  cancel_time  datetime64[ns]
 15  x            float64
 16  y            float64
dtypes: datetime64[ns](5), float64(2), int64(8), object(2)
memory usage: 474.8+ MB

### Name / Unit

In [99]:
order = order.rename(columns = {"이용자ID":"ID", "탑승정류장":"alight_station", "하차정류장":"off_station", "어른(명)":"adult", "청소년(명)":"teen", "어린이(명)":"child", 
                                "이동거리(m)":"distance", "요금(원)":"fare", "배차상태":"suc_status", "배차상태상세":"suc_status_d"})

In [101]:
# change unit of "distance" (m to km)

order['distance'] = order['distance'] / 1000

### Remove Outlier

In [ ]:
pd.read_csv('order.csv')